<?php
// +----------------------------------------------------------------------
// | 微信自定义菜单
// +----------------------------------------------------------------------
// | Copyright (c) 2012-2014
// +----------------------------------------------------------------------
// | Author: zhaojie
// +----------------------------------------------------------------------
namespace Api\Controller;

use Common\Controller\ShuipFCMS;

class WeatherController extends ShuipFCMS
{
    // 专题首页
    public function index()
    {

        $this->display();
    }


}

?>