<?php
// +----------------------------------------------------------------------
// | 微信接口
// +----------------------------------------------------------------------
// | Copyright (c) 2012-2014
// +----------------------------------------------------------------------
// | Author: zhaojie
// +----------------------------------------------------------------------
namespace Photo\Controller;

use Common\Controller\ShuipFCMS;

class PhotoController extends ShuipFCMS
{
    

    // 管理中心显示图片信息
    public function  index(){
        
        $this->display();
    }

    

}