<?php
/**
 * 项目公共配置文件
 * 该文件请不要修改，如果要覆盖惯例配置的值，可在应用配置文件中设定和惯例不符的配置项
 * 配置名称大小写任意，系统会统一转换成小写
 * 所有配置参数都可以在生效前动态改变
 */
return array(
    /* 应用设定 */
    "WX_APP_ID" => "wx38196e90f20a9a1a",
    "WX_SECRET" => "feba9261a8dab4317448fddaca5ef675",
    "WX_TOKEN" => "hubeiqixiang",

    // 2、3、4冰雹、5大风、6沙尘暴、7高温、8干旱、9雷电、10冰雹、11霜冻、12大雾、13霾、14道路结冰
    "WEATHER_SIGN" => array(
        '台风蓝色' => '24',
        '台风黄色' => '24',
        '台风橙色' => '12',
        '台风红色' => '6',

        '暴雨蓝色' => '12',
        '暴雨黄色' => '6',
        '暴雨橙色' => '3',
        '暴雨红色' => '3',

        '暴雪蓝色' => '12',
        '暴雪黄色' => '12',
        '暴雪橙色' => '6',
        '暴雪红色' => '6',

        '寒潮蓝色' => '48',
        '寒潮黄色' => '48',
        '寒潮橙色' => '24',
        '寒潮红色' => '24',

        '大风蓝色' => '24',
        '大风黄色' => '12',
        '大风橙色' => '6',
        '大风红色' => '6',

        '高温黄色' => '72',
        '高温橙色' => '24',
        '高温红色' => '24',

        '雷电黄色' => '6',
        '雷电橙色' => '2',
        '雷电红色' => '2',

        '霜冻蓝色' => '48',
        '霜冻黄色' => '24',
        '霜冻橙色' => '24',

        '大雾黄色' => '12',
        '大雾橙色' => '2',
        '大雾红色' => '6',

        '道路结冰黄色' => '12',
        '道路结冰橙色' => '6',
        '道路结冰红色' => '2',

        '冰雹橙色' => '6',
        '冰雹红色' => '2',

        // 一周内
        '干旱橙色' => '168',
        '干旱红色' => '168',

        '霾黄色' => '24',
        '霾橙色' => '24',
        '霾红色' => '24',

    ),
	
	
	"WEATHER_SIGN_IMG" => array(
        '台风蓝色' => 'taifeng_b.jpg',
        '台风黄色' => 'taifeng_y.jpg',
        '台风橙色' => 'taifeng_b.jpg',
        '台风红色' => 'taifeng_b.jpg',

        '暴雨蓝色' => 'baoyu_b.jpg',
        '暴雨黄色' => 'baoyu_y.jpg',
        '暴雨橙色' => 'baoyu_o.jpg',
        '暴雨红色' => 'baoyu_r.jpg',

        '暴雪蓝色' => 'baoxue_b.jpg',
        '暴雪黄色' => 'baoxue_y.jpg',
        '暴雪橙色' => 'baoxue_o.jpg',
        '暴雪红色' => 'baoxue_r.jpg',

        '寒潮蓝色' => 'hanchao_b.jpg',
        '寒潮黄色' => 'hanchao_y.jpg',
        '寒潮橙色' => 'hanchao_o.jpg',
        '寒潮红色' => 'hanchao_r.jpg',

        '大风蓝色' => 'dafeng_b.jpg',
        '大风黄色' => 'dafeng_y.jpg',
        '大风橙色' => 'dafeng_o.jpg',
        '大风红色' => 'dafeng_r.jpg',

        '高温黄色' => 'gaowen_y.jpg',
        '高温橙色' => 'gaowen_o.jpg',
        '高温红色' => 'gaowen_r.jpg',

        '雷电黄色' => 'leidian_y.jpg',
        '雷电橙色' => 'leidian_o.jpg',
        '雷电红色' => 'leidian_r.jpg',

        '霜冻蓝色' => 'shuangdong_b.jpg',
        '霜冻黄色' => 'shuangdong_y.jpg',
        '霜冻橙色' => 'shuangdong_o.jpg',

        '大雾黄色' => 'dawu_y.jpg',
        '大雾橙色' => 'dawu_o.jpg',
        '大雾红色' => 'dawu_r.jpg',

        '道路结冰黄色' => 'dljb_y.jpg',
        '道路结冰橙色' => 'dljb_o.jpg',
        '道路结冰红色' => 'dljb_r.jpg',

        '冰雹橙色' => 'bingbao_o.jpg',
        '冰雹红色' => 'bingbao_r.jpg',

        // 一周内
        '干旱橙色' => 'ganhan_o.jpg',
        '干旱红色' => 'ganhan_r.jpg',

        '霾黄色' => 'mai_y.jpg',
        '霾橙色' => 'mai_o.jpg',
        '霾红色' => 'mai_o.jpg',

    )
);
